In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
train=pd.read_csv(r'F:\Kaggle Data Sets\Food Prediction Model\train.csv')

In [3]:
meal_info=pd.read_csv(r'F:\Kaggle Data Sets\Food Prediction Model\meal_info.csv')
centre_info=pd.read_csv(r'F:\Kaggle Data Sets\Food Prediction Model\fulfilment_center_info.csv')

In [5]:
train.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders
0,1379560,1,55,1885,136.83,152.29,0,0,177
1,1466964,1,55,1993,136.83,135.83,0,0,270
2,1346989,1,55,2539,134.86,135.86,0,0,189
3,1338232,1,55,2139,339.50,437.53,0,0,54
4,1448490,1,55,2631,243.50,242.50,0,0,40

In [6]:
meal_info.head()

   meal_id   category cuisine
0     1885  Beverages    Thai
1     1993  Beverages    Thai
2     2539  Beverages    Thai
3     1248  Beverages  Indian
4     2631  Beverages  Indian

In [7]:
centre_info.head()

   center_id  city_code  region_code center_type  op_area
0         11        679           56      TYPE_A      3.7
1         13        590           56      TYPE_B      6.7
2        124        590           56      TYPE_C      4.0
3         66        648           34      TYPE_A      4.1
4         94        632           34      TYPE_C      3.6

In [8]:
test=pd.read_csv(r'F:\Kaggle Data Sets\Food Prediction Model\test.csv')
sample=pd.read_csv(r'F:\Kaggle Data Sets\Food Prediction Model\sample_submission.csv')

In [9]:
test.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured
0,1028232,146,55,1885,158.11,159.11,0,0
1,1127204,146,55,1993,160.11,159.11,0,0
2,1212707,146,55,2539,157.14,159.14,0,0
3,1082698,146,55,2631,162.02,162.02,0,0
4,1400926,146,55,1248,163.93,163.93,0,0

In [10]:
sample.head()

        id  num_orders
0  1028232           0
1  1127204           0
2  1212707           0
3  1082698           0
4  1400926           0

In [11]:
train.shape

(456548, 9)

In [12]:
train.dtypes

id                         int64
week                       int64
center_id                  int64
meal_id                    int64
checkout_price           float64
base_price               float64
emailer_for_promotion      int64
homepage_featured          int64
num_orders                 int64
dtype: object

In [13]:
train.nunique()

id                       456548
week                        145
center_id                    77
meal_id                      51
checkout_price             1992
base_price                 1907
emailer_for_promotion         2
homepage_featured             2
num_orders                 1250
dtype: int64

In [14]:
train.isna().sum()

id                       0
week                     0
center_id                0
meal_id                  0
checkout_price           0
base_price               0
emailer_for_promotion    0
homepage_featured        0
num_orders               0
dtype: int64

In [18]:
print(centre_info.nunique())
#print(train.center_id.nunique())

center_id      77
city_code      51
region_code     8
center_type     3
op_area        30
dtype: int64

In [17]:
print(train.center_id.nunique())

77

In [ ]:
city_code=list()
region_code=list()
center_type=list()
op_area=list()

for i in train.index:
    id=train.loc[i,'center_id']
    city_code.append(centre_info[centre_info.center_id==id].city_code)
    region_code.append(centre_info[centre_info.center_id==id].region_code)
    center_type.append(centre_info[centre_info.center_id==id].center_type)
    op_area.append(centre_info[centre_info.center_id==id].op_area)
    
print(city_code[:5])
print(region_code[:5])
print(center_type[:5])
print(op_area[:5])